susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32F217.h
#define FSMC_A20_PE4_ PE4,GPIO_AF12
#define _FSMC_A20_PE4_ 1

#define FSMC_A21_PE5_ PE5,GPIO_AF12
#define _FSMC_A21_PE5_ 1

#define FSMC_A22_PE6_ PE6,GPIO_AF12
#define _FSMC_A22_PE6_ 1

#define FSMC_A23_PE2_ PE2,GPIO_AF12
#define _FSMC_A23_PE2_ 1

#define FSMC_A24_PG13_ PG13,GPIO_AF12
#define _FSMC_A24_PG13_ 1

#define FSMC_A25_PG14_ PG14,GPIO_AF12
#define _FSMC_A25_PG14_ 1

#define FSMC_A3_PF3_ PF3,GPIO_AF12
#define _FSMC_A3_PF3_ 1

#define FSMC_A4_PF4_ PF4,GPIO_AF12
#define _FSMC_A4_PF4_ 1

#define FSMC_A5_PF5_ PF5,GPIO_AF12
#define _FSMC_A5_PF5_ 1

#define FSMC_A6_PF12_ PF12,GPIO_AF12
#define _FSMC_A6_PF12_ 1

#define FSMC_A7_PF13_ PF13,GPIO_AF12
#define _FSMC_A7_PF13_ 1

#define FSMC_A8_PF14_ PF14,GPIO_AF12
#define _FSMC_A8_PF14_ 1

#define FSMC_A9_PF15_ PF15,GPIO_AF12
#define _FSMC_A9_PF15_ 1

#define FSMC_ALE_PD12_ PD12,GPIO_AF12
#define _FSMC_ALE_PD12_ 1

#define FSMC_CD_PF9_ PF9,GPIO_AF12
#define _FSMC_CD_PF9_ 1

#define FSMC_CLE_PD11_ PD11,GPIO_AF12
#define _FSMC_CLE_PD11_ 1

#define FSMC_CLK_PD3_ PD3,GPIO_AF12
#define _FSMC_CLK_PD3_ 1

#define FSMC_D0_PD14_ PD14,GPIO_AF12
#define _FSMC_D0_PD14_ 1

#define FSMC_D1_PD15_ PD15,GPIO_AF12
#define _FSMC_D1_PD15_ 1

#define FSMC_D10_PE13_ PE13,GPIO_AF12
#define _FSMC_D10_PE13_ 1

#define FSMC_D11_PE14_ PE14,GPIO_AF12
#define _FSMC_D11_PE14_ 1

#define FSMC_D12_PE15_ PE15,GPIO_AF12
#define _FSMC_D12_PE15_ 1

#define FSMC_D13_PD8_ PD8,GPIO_AF12
#define _FSMC_D13_PD8_ 1

#define FSMC_D14_PD9_ PD9,GPIO_AF12
#define _FSMC_D14_PD9_ 1

#define FSMC_D15_PD10_ PD10,GPIO_AF12
#define _FSMC_D15_PD10_ 1

#define FSMC_D2_PD0_ PD0,GPIO_AF12
#define _FSMC_D2_PD0_ 1

#define FSMC_D3_PD1_ PD1,GPIO_AF12
#define _FSMC_D3_PD1_ 1

#define FSMC_D4_PE7_ PE7,GPIO_AF12
#define _FSMC_D4_PE7_ 1

#define FSMC_D5_PE8_ PE8,GPIO_AF12
#define _FSMC_D5_PE8_ 1

#define FSMC_D6_PE9_ PE9,GPIO_AF12
#define _FSMC_D6_PE9_ 1

#define FSMC_D7_PE10_ PE10,GPIO_AF12
#define _FSMC_D7_PE10_ 1

#define FSMC_D8_PE11_ PE11,GPIO_AF12
#define _FSMC_D8_PE11_ 1

#define FSMC_D9_PE12_ PE12,GPIO_AF12
#define _FSMC_D9_PE12_ 1

#define FSMC_DA0_PD14_ PD14,GPIO_AF12
#define _FSMC_DA0_PD14_ 1

#define FSMC_DA1_PD15_ PD15,GPIO_AF12
#define _FSMC_DA1_PD15_ 1

#define FSMC_DA10_PE13_ PE13,GPIO_AF12
#define _FSMC_DA10_PE13_ 1

#define FSMC_DA11_PE14_ PE14,GPIO_AF12
#define _FSMC_DA11_PE14_ 1

#define FSMC_DA12_PE15_ PE15,GPIO_AF12
#define _FSMC_DA12_PE15_ 1

#define FSMC_DA13_PD8_ PD8,GPIO_AF12
#define _FSMC_DA13_PD8_ 1

#define FSMC_DA14_PD9_ PD9,GPIO_AF12
#define _FSMC_DA14_PD9_ 1

#define FSMC_DA15_PD10_ PD10,GPIO_AF12
#define _FSMC_DA15_PD10_ 1

#define FSMC_DA2_PD0_ PD0,GPIO_AF12
#define _FSMC_DA2_PD0_ 1

#define FSMC_DA3_PD1_ PD1,GPIO_AF12
#define _FSMC_DA3_PD1_ 1

#define FSMC_DA4_PE7_ PE7,GPIO_AF12
#define _FSMC_DA4_PE7_ 1

#define FSMC_DA5_PE8_ PE8,GPIO_AF12
#define _FSMC_DA5_PE8_ 1

#define FSMC_DA6_PE9_ PE9,GPIO_AF12
#define _FSMC_DA6_PE9_ 1

#define FSMC_DA7_PE10_ PE10,GPIO_AF12
#define _FSMC_DA7_PE10_ 1

#define FSMC_DA8_PE11_ PE11,GPIO_AF12
#define _FSMC_DA8_PE11_ 1

#define FSMC_DA9_PE12_ PE12,GPIO_AF12
#define _FSMC_DA9_PE12_ 1

#define FSMC_INT2_PG6_ PG6,GPIO_AF12
#define _FSMC_INT2_PG6_ 1

#define FSMC_INT3_PG7_ PG7,GPIO_AF12
#define _FSMC_INT3_PG7_ 1

#define FSMC_INTR_PF10_ PF10,GPIO_AF12
#define _FSMC_INTR_PF10_ 1

#define FSMC_NBL0_PE0_ PE0,GPIO_AF12
#define _FSMC_NBL0_PE0_ 1

#define FSMC_NBL1_PE1_ PE1,GPIO_AF12
#define _FSMC_NBL1_PE1_ 1

#define FSMC_NCE2_PD7_ PD7,GPIO_AF12
#define _FSMC_NCE2_PD7_ 1

#define FSMC_NCE3_PG9_ PG9,GPIO_AF12
#define _FSMC_NCE3_PG9_ 1

#define FSMC_NCE4_1_PG10_ PG10,GPIO_AF12
#define _FSMC_NCE4_1_PG10_ 1

#define FSMC_NCE4_2_PG11_ PG11,GPIO_AF12
#define _FSMC_NCE4_2_PG11_ 1

#define FSMC_NE1_PD7_ PD7,GPIO_AF12
#define _FSMC_NE1_PD7_ 1

#define FSMC_NE2_PG9_ PG9,GPIO_AF12
#define _FSMC_NE2_PG9_ 1

#define FSMC_NE3_PG10_ PG10,GPIO_AF12
#define _FSMC_NE3_PG10_ 1

#define FSMC_NE4_PG12_ PG12,GPIO_AF12
#define _FSMC_NE4_PG12_ 1

#define FSMC_NIORD_PF6_ PF6,GPIO_AF12
#define _FSMC_NIORD_PF6_ 1

#define FSMC_NIOWR_PF8_ PF8,GPIO_AF12
#define _FSMC_NIOWR_PF8_ 1

#define FSMC_NL_PB7_ PB7,GPIO_AF12
#define _FSMC_NL_PB7_ 1

#define FSMC_NOE_PD4_ PD4,GPIO_AF12
#define _FSMC_NOE_PD4_ 1

#define FSMC_NREG_PF7_ PF7,GPIO_AF12
#define _FSMC_NREG_PF7_ 1

#define FSMC_NWAIT_PD6_ PD6,GPIO_AF12
#define _FSMC_NWAIT_PD6_ 1

#define FSMC_NWE_PD5_ PD5,GPIO_AF12
#define _FSMC_NWE_PD5_ 1

#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF4
#define I2C2_SCL_PF1_ PF1,GPIO_AF4
#define I2C2_SCL_PH4_ PH4,GPIO_AF4
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PF1_ 1
#define _I2C2_SCL_PH4_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF4
#define I2C2_SDA_PF0_ PF0,GPIO_AF4
#define I2C2_SDA_PH5_ PH5,GPIO_AF4
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PF0_ 1
#define _I2C2_SDA_PH5_ 1

#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define I2C2_SMBA_PF2_ PF2,GPIO_AF4
#define I2C2_SMBA_PH6_ PH6,GPIO_AF4
#define _I2C2_SMBA_PB12_ 1
#define _I2C2_SMBA_PF2_ 1
#define _I2C2_SMBA_PH6_ 1

#define I2C3_SCL_PA8_ PA8,GPIO_AF4
#define I2C3_SCL_PH7_ PH7,GPIO_AF4
#define _I2C3_SCL_PA8_ 1
#define _I2C3_SCL_PH7_ 1

#define I2C3_SDA_PC9_ PC9,GPIO_AF4
#define I2C3_SDA_PH8_ PH8,GPIO_AF4
#define _I2C3_SDA_PC9_ 1
#define _I2C3_SDA_PH8_ 1

#define I2C3_SMBA_PA9_ PA9,GPIO_AF4
#define I2C3_SMBA_PH9_ PH9,GPIO_AF4
#define _I2C3_SMBA_PA9_ 1
#define _I2C3_SMBA_PH9_ 1

#define I2S2_MCK_PC6_ PC6,GPIO_AF5
#define _I2S2_MCK_PC6_ 1

#define I2S2_SCK_PB10_ PB10,GPIO_AF5
#define I2S2_SCK_PB13_ PB13,GPIO_AF5
#define I2S2_SCK_PI1_ PI1,GPIO_AF5
#define _I2S2_SCK_PB10_ 1
#define _I2S2_SCK_PB13_ 1
#define _I2S2_SCK_PI1_ 1

#define I2S2_SD_PB15_ PB15,GPIO_AF5
#define I2S2_SD_PC3_ PC3,GPIO_AF5
#define I2S2_SD_PI3_ PI3,GPIO_AF5
#define _I2S2_SD_PB15_ 1
#define _I2S2_SD_PC3_ 1
#define _I2S2_SD_PI3_ 1

