susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32F217.h
#define I2S2_WS_PB12_ PB12,GPIO_AF5
#define I2S2_WS_PB9_ PB9,GPIO_AF5
#define I2S2_WS_PI0_ PI0,GPIO_AF5
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PB9_ 1
#define _I2S2_WS_PI0_ 1

#define I2S3_MCK_PC7_ PC7,GPIO_AF6
#define _I2S3_MCK_PC7_ 1

#define I2S3_SCK_PB3_ PB3,GPIO_AF6
#define I2S3_SCK_PC10_ PC10,GPIO_AF6
#define _I2S3_SCK_PB3_ 1
#define _I2S3_SCK_PC10_ 1

#define I2S3_SD_PB5_ PB5,GPIO_AF6
#define I2S3_SD_PC12_ PC12,GPIO_AF6
#define _I2S3_SD_PB5_ 1
#define _I2S3_SD_PC12_ 1

#define I2S3_WS_PA15_ PA15,GPIO_AF6
#define I2S3_WS_PA4_ PA4,GPIO_AF6
#define _I2S3_WS_PA15_ 1
#define _I2S3_WS_PA4_ 1

#define I2S_CKIN_PC9_ PC9,GPIO_AF5
#define _I2S_CKIN_PC9_ 1

#define RCC_MCO_1_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_1_PA8_ 1

#define RCC_MCO_2_PC9_ PC9,GPIO_AF0
#define _RCC_MCO_2_PC9_ 1

#define RCC_OSC32_IN_PC14_ PC14,GPIO_AF0
#define _RCC_OSC32_IN_PC14_ 1

#define RCC_OSC32_OUT_PC15_ PC15,GPIO_AF0
#define _RCC_OSC32_OUT_PC15_ 1

#define RCC_OSC_IN_PH0_ PH0,GPIO_AF0
#define _RCC_OSC_IN_PH0_ 1

#define RCC_OSC_OUT_PH1_ PH1,GPIO_AF0
#define _RCC_OSC_OUT_PH1_ 1

#define RTC_AF1_PC13_ PC13,GPIO_AF0
#define _RTC_AF1_PC13_ 1

#define RTC_AF2_PI8_ PI8,GPIO_AF0
#define _RTC_AF2_PI8_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PB15_ 1

#define SDIO_CK_PC12_ PC12,GPIO_AF12
#define _SDIO_CK_PC12_ 1

#define SDIO_CMD_PD2_ PD2,GPIO_AF12
#define _SDIO_CMD_PD2_ 1

#define SDIO_D0_PC8_ PC8,GPIO_AF12
#define _SDIO_D0_PC8_ 1

#define SDIO_D1_PC9_ PC9,GPIO_AF12
#define _SDIO_D1_PC9_ 1

#define SDIO_D2_PC10_ PC10,GPIO_AF12
#define _SDIO_D2_PC10_ 1

#define SDIO_D3_PC11_ PC11,GPIO_AF12
#define _SDIO_D3_PC11_ 1

#define SDIO_D4_PB8_ PB8,GPIO_AF12
#define _SDIO_D4_PB8_ 1

#define SDIO_D5_PB9_ PB9,GPIO_AF12
#define _SDIO_D5_PB9_ 1

#define SDIO_D6_PC6_ PC6,GPIO_AF12
#define _SDIO_D6_PC6_ 1

#define SDIO_D7_PC7_ PC7,GPIO_AF12
#define _SDIO_D7_PC7_ 1

#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4_ PB4,GPIO_AF5
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1

#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1

#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3_ PB3,GPIO_AF5
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1

#define SPI2_MISO_PB14_ PB14,GPIO_AF5
#define SPI2_MISO_PC2_ PC2,GPIO_AF5
#define SPI2_MISO_PI2_ PI2,GPIO_AF5
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PC2_ 1
#define _SPI2_MISO_PI2_ 1

#define SPI2_MOSI_PB15_ PB15,GPIO_AF5
#define SPI2_MOSI_PC3_ PC3,GPIO_AF5
#define SPI2_MOSI_PI3_ PI3,GPIO_AF5
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PC3_ 1
#define _SPI2_MOSI_PI3_ 1

#define SPI2_NSS_PB12_ PB12,GPIO_AF5
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define SPI2_NSS_PI0_ PI0,GPIO_AF5
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB9_ 1
#define _SPI2_NSS_PI0_ 1

#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF5
#define SPI2_SCK_PI1_ PI1,GPIO_AF5
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PI1_ 1

#define SPI3_MISO_PB4_ PB4,GPIO_AF6
#define SPI3_MISO_PC11_ PC11,GPIO_AF6
#define _SPI3_MISO_PB4_ 1
#define _SPI3_MISO_PC11_ 1

#define SPI3_MOSI_PB5_ PB5,GPIO_AF6
#define SPI3_MOSI_PC12_ PC12,GPIO_AF6
#define _SPI3_MOSI_PB5_ 1
#define _SPI3_MOSI_PC12_ 1

#define SPI3_NSS_PA15_ PA15,GPIO_AF6
#define SPI3_NSS_PA4_ PA4,GPIO_AF6
#define _SPI3_NSS_PA15_ 1
#define _SPI3_NSS_PA4_ 1

#define SPI3_SCK_PB3_ PB3,GPIO_AF6
#define SPI3_SCK_PC10_ PC10,GPIO_AF6
#define _SPI3_SCK_PB3_ 1
#define _SPI3_SCK_PC10_ 1

#define SYS_JTCK-SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_JTCK-SWCLK_PA14_ 1

#define SYS_JTDI_PA15_ PA15,GPIO_AF0
#define _SYS_JTDI_PA15_ 1

#define SYS_JTDO-SWO_PB3_ PB3,GPIO_AF0
#define _SYS_JTDO-SWO_PB3_ 1

#define SYS_JTMS-SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_JTMS-SWDIO_PA13_ 1

#define SYS_JTRST_PB4_ PB4,GPIO_AF0
#define _SYS_JTRST_PB4_ 1

#define SYS_TRACECLK_PE2_ PE2,GPIO_AF0
#define _SYS_TRACECLK_PE2_ 1

#define SYS_TRACED0_PE3_ PE3,GPIO_AF0
#define _SYS_TRACED0_PE3_ 1

#define SYS_TRACED1_PE4_ PE4,GPIO_AF0
#define _SYS_TRACED1_PE4_ 1

#define SYS_TRACED2_PE5_ PE5,GPIO_AF0
#define _SYS_TRACED2_PE5_ 1

#define SYS_TRACED3_PE6_ PE6,GPIO_AF0
#define _SYS_TRACED3_PE6_ 1

#define SYS_WKUP_PA0_ PA0,GPIO_AF0
#define _SYS_WKUP_PA0_ 1

#define TIM10_CH1_PB8_ PB8,GPIO_AF3
#define TIM10_CH1_PF6_ PF6,GPIO_AF3
#define _TIM10_CH1_PB8_ 1
#define _TIM10_CH1_PF6_ 1

#define TIM11_CH1_PB9_ PB9,GPIO_AF3
#define TIM11_CH1_PF7_ PF7,GPIO_AF3
#define _TIM11_CH1_PB9_ 1
#define _TIM11_CH1_PF7_ 1

#define TIM12_CH1_PB14_ PB14,GPIO_AF9
#define TIM12_CH1_PH6_ PH6,GPIO_AF9
#define _TIM12_CH1_PB14_ 1
#define _TIM12_CH1_PH6_ 1

#define TIM12_CH2_PB15_ PB15,GPIO_AF9
#define TIM12_CH2_PH9_ PH9,GPIO_AF9
#define _TIM12_CH2_PB15_ 1
#define _TIM12_CH2_PH9_ 1

#define TIM13_CH1_PA6_ PA6,GPIO_AF9
#define TIM13_CH1_PF8_ PF8,GPIO_AF9
#define _TIM13_CH1_PA6_ 1
#define _TIM13_CH1_PF8_ 1

#define TIM14_CH1_PA7_ PA7,GPIO_AF9
#define TIM14_CH1_PF9_ PF9,GPIO_AF9
#define _TIM14_CH1_PA7_ 1
#define _TIM14_CH1_PF9_ 1

#define TIM1_BKIN_PA6_ PA6,GPIO_AF1
#define TIM1_BKIN_PB12_ PB12,GPIO_AF1
#define TIM1_BKIN_PE15_ PE15,GPIO_AF1
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PB12_ 1
#define _TIM1_BKIN_PE15_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF1
#define TIM1_CH1_PE9_ PE9,GPIO_AF1
#define _TIM1_CH1_PA8_ 1
#define _TIM1_CH1_PE9_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF1
#define TIM1_CH1N_PB13_ PB13,GPIO_AF1
#define TIM1_CH1N_PE8_ PE8,GPIO_AF1
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1
#define _TIM1_CH1N_PE8_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF1
#define TIM1_CH2_PE11_ PE11,GPIO_AF1
#define _TIM1_CH2_PA9_ 1
#define _TIM1_CH2_PE11_ 1

#define TIM1_CH2N_PB0_ PB0,GPIO_AF1
#define TIM1_CH2N_PB14_ PB14,GPIO_AF1
#define TIM1_CH2N_PE10_ PE10,GPIO_AF1
#define _TIM1_CH2N_PB0_ 1
#define _TIM1_CH2N_PB14_ 1
#define _TIM1_CH2N_PE10_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF1
#define TIM1_CH3_PE13_ PE13,GPIO_AF1
#define _TIM1_CH3_PA10_ 1
#define _TIM1_CH3_PE13_ 1

#define TIM1_CH3N_PB1_ PB1,GPIO_AF1
#define TIM1_CH3N_PB15_ PB15,GPIO_AF1
#define TIM1_CH3N_PE12_ PE12,GPIO_AF1
#define _TIM1_CH3N_PB1_ 1
#define _TIM1_CH3N_PB15_ 1
#define _TIM1_CH3N_PE12_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF1
#define TIM1_CH4_PE14_ PE14,GPIO_AF1
#define _TIM1_CH4_PA11_ 1
#define _TIM1_CH4_PE14_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF1
#define TIM1_ETR_PE7_ PE7,GPIO_AF1
#define _TIM1_ETR_PA12_ 1
#define _TIM1_ETR_PE7_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA15_ PA15,GPIO_AF1
#define TIM2_CH1_PA5_ PA5,GPIO_AF1
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1

